; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-23-21)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 - object)
(:init
(at-robby robot1 room19)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room23)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room9)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room14)
(at ball2 room1)
(at ball3 room1)
(at ball4 room7)
(at ball5 room18)
(at ball6 room16)
(at ball7 room17)
(at ball8 room20)
(at ball9 room17)
(at ball10 room12)
(at ball11 room10)
(at ball12 room1)
(at ball13 room2)
(at ball14 room8)
(at ball15 room9)
(at ball16 room3)
(at ball17 room3)
(at ball18 room7)
(at ball19 room21)
(at ball20 room4)
(at ball21 room5)
)
(:goal
(and
(at ball1 room10)
(at ball2 room19)
(at ball3 room17)
(at ball4 room3)
(at ball5 room14)
(at ball6 room22)
(at ball7 room3)
(at ball8 room10)
(at ball9 room21)
(at ball10 room12)
(at ball11 room23)
(at ball12 room22)
(at ball13 room12)
(at ball14 room6)
(at ball15 room16)
(at ball16 room5)
(at ball17 room23)
(at ball18 room13)
(at ball19 room21)
(at ball20 room11)
(at ball21 room22)
)
)
)

; plan
1. (pick robot3 ball15 room9 lgripper3)
   deleted: (at ball15 room9) (free robot3 lgripper3)
   added: (carry robot3 ball15 lgripper3)
   goals met: 2 of 21
2. (move robot1 room19 room8)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room8)
   goals met: 2 of 21
3. (move robot2 room23 room7)
   deleted: (at-robby robot2 room23)
   added: (at-robby robot2 room7)
   goals met: 2 of 21
4. (move robot3 room9 room16)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room16)
   goals met: 2 of 21
5. (pick robot2 ball4 room7 lgripper2)
   deleted: (at ball4 room7) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 2 of 21
6. (pick robot1 ball14 room8 lgripper1)
   deleted: (at ball14 room8) (free robot1 lgripper1)
   added: (carry robot1 ball14 lgripper1)
   goals met: 2 of 21
7. (pick robot2 ball18 room7 rgripper2)
   deleted: (at ball18 room7) (free robot2 rgripper2)
   added: (carry robot2 ball18 rgripper2)
   goals met: 2 of 21
8. (drop robot3 ball15 room16 lgripper3)
   deleted: (carry robot3 ball15 lgripper3)
   added: (at ball15 room16) (free robot3 lgripper3)
   goals met: 3 of 21
9. (move robot1 room8 room6)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room6)
   goals met: 3 of 21
10. (move robot2 room7 room3)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room3)
   goals met: 3 of 21
11. (pick robot3 ball6 room16 rgripper3)
   deleted: (at ball6 room16) (free robot3 rgripper3)
   added: (carry robot3 ball6 rgripper3)
   goals met: 3 of 21
12. (move robot3 room16 room4)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room4)
   goals met: 3 of 21
13. (drop robot1 ball14 room6 lgripper1)
   deleted: (carry robot1 ball14 lgripper1)
   added: (at ball14 room6) (free robot1 lgripper1)
   goals met: 4 of 21
14. (drop robot2 ball4 room3 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room3) (free robot2 lgripper2)
   goals met: 5 of 21
15. (pick robot3 ball20 room4 lgripper3)
   deleted: (at ball20 room4) (free robot3 lgripper3)
   added: (carry robot3 ball20 lgripper3)
   goals met: 5 of 21
16. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 5 of 21
17. (move robot1 room6 room18)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room18)
   goals met: 5 of 21
18. (move robot3 room4 room22)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room22)
   goals met: 5 of 21
19. (pick robot2 ball13 room2 lgripper2)
   deleted: (at ball13 room2) (free robot2 lgripper2)
   added: (carry robot2 ball13 lgripper2)
   goals met: 5 of 21
20. (pick robot1 ball5 room18 lgripper1)
   deleted: (at ball5 room18) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 5 of 21
21. (drop robot3 ball6 room22 rgripper3)
   deleted: (carry robot3 ball6 rgripper3)
   added: (at ball6 room22) (free robot3 rgripper3)
   goals met: 6 of 21
22. (move robot2 room2 room13)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room13)
   goals met: 6 of 21
23. (move robot1 room18 room10)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room10)
   goals met: 6 of 21
24. (move robot3 room22 room11)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room11)
   goals met: 6 of 21
25. (drop robot2 ball18 room13 rgripper2)
   deleted: (carry robot2 ball18 rgripper2)
   added: (at ball18 room13) (free robot2 rgripper2)
   goals met: 7 of 21
26. (move robot1 room10 room14)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room14)
   goals met: 7 of 21
27. (drop robot3 ball20 room11 lgripper3)
   deleted: (carry robot3 ball20 lgripper3)
   added: (at ball20 room11) (free robot3 lgripper3)
   goals met: 8 of 21
28. (move robot2 room13 room12)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room12)
   goals met: 8 of 21
29. (drop robot1 ball5 room14 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room14) (free robot1 lgripper1)
   goals met: 9 of 21
30. (pick robot1 ball1 room14 rgripper1)
   deleted: (at ball1 room14) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 9 of 21
31. (drop robot2 ball13 room12 lgripper2)
   deleted: (carry robot2 ball13 lgripper2)
   added: (at ball13 room12) (free robot2 lgripper2)
   goals met: 10 of 21
32. (move robot3 room11 room5)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room5)
   goals met: 10 of 21
33. (move robot1 room14 room5)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room5)
   goals met: 10 of 21
34. (move robot1 room5 room20)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room20)
   goals met: 10 of 21
35. (move robot2 room12 room5)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room5)
   goals met: 10 of 21
36. (pick robot3 ball21 room5 lgripper3)
   deleted: (at ball21 room5) (free robot3 lgripper3)
   added: (carry robot3 ball21 lgripper3)
   goals met: 10 of 21
37. (pick robot1 ball8 room20 lgripper1)
   deleted: (at ball8 room20) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 10 of 21
38. (move robot3 room5 room22)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room22)
   goals met: 10 of 21
39. (move robot2 room5 room17)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room17)
   goals met: 10 of 21
40. (move robot1 room20 room10)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room10)
   goals met: 10 of 21
41. (drop robot3 ball21 room22 lgripper3)
   deleted: (carry robot3 ball21 lgripper3)
   added: (at ball21 room22) (free robot3 lgripper3)
   goals met: 11 of 21
42. (pick robot2 ball9 room17 lgripper2)
   deleted: (at ball9 room17) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 11 of 21
43. (drop robot1 ball8 room10 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room10) (free robot1 lgripper1)
   goals met: 12 of 21
44. (drop robot1 ball1 room10 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room10) (free robot1 rgripper1)
   goals met: 13 of 21
45. (move robot2 room17 room21)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room21)
   goals met: 13 of 21
46. (move robot3 room22 room5)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room5)
   goals met: 13 of 21
47. (drop robot2 ball9 room21 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room21) (free robot2 lgripper2)
   goals met: 14 of 21
48. (pick robot1 ball11 room10 rgripper1)
   deleted: (at ball11 room10) (free robot1 rgripper1)
   added: (carry robot1 ball11 rgripper1)
   goals met: 14 of 21
49. (move robot3 room5 room3)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room3)
   goals met: 14 of 21
50. (move robot1 room10 room23)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room23)
   goals met: 14 of 21
51. (move robot2 room21 room5)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room5)
   goals met: 14 of 21
52. (pick robot3 ball17 room3 lgripper3)
   deleted: (at ball17 room3) (free robot3 lgripper3)
   added: (carry robot3 ball17 lgripper3)
   goals met: 14 of 21
53. (pick robot3 ball16 room3 rgripper3)
   deleted: (at ball16 room3) (free robot3 rgripper3)
   added: (carry robot3 ball16 rgripper3)
   goals met: 14 of 21
54. (drop robot1 ball11 room23 rgripper1)
   deleted: (carry robot1 ball11 rgripper1)
   added: (at ball11 room23) (free robot1 rgripper1)
   goals met: 15 of 21
55. (move robot3 room3 room5)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room5)
   goals met: 15 of 21
56. (move robot2 room5 room3)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room3)
   goals met: 15 of 21
57. (drop robot3 ball16 room5 rgripper3)
   deleted: (carry robot3 ball16 rgripper3)
   added: (at ball16 room5) (free robot3 rgripper3)
   goals met: 16 of 21
58. (move robot1 room23 room3)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room3)
   goals met: 16 of 21
59. (move robot2 room3 room17)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room17)
   goals met: 16 of 21
60. (pick robot2 ball7 room17 lgripper2)
   deleted: (at ball7 room17) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 16 of 21
61. (move robot3 room5 room23)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room23)
   goals met: 16 of 21
62. (move robot1 room3 room22)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room22)
   goals met: 16 of 21
63. (drop robot3 ball17 room23 lgripper3)
   deleted: (carry robot3 ball17 lgripper3)
   added: (at ball17 room23) (free robot3 lgripper3)
   goals met: 17 of 21
64. (move robot2 room17 room3)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room3)
   goals met: 17 of 21
65. (move robot1 room22 room1)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room1)
   goals met: 17 of 21
66. (drop robot2 ball7 room3 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room3) (free robot2 lgripper2)
   goals met: 18 of 21
67. (pick robot1 ball3 room1 lgripper1)
   deleted: (at ball3 room1) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 18 of 21
68. (pick robot1 ball2 room1 rgripper1)
   deleted: (at ball2 room1) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 18 of 21
69. (move robot3 room23 room1)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room1)
   goals met: 18 of 21
70. (move robot1 room1 room17)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room17)
   goals met: 18 of 21
71. (pick robot3 ball12 room1 lgripper3)
   deleted: (at ball12 room1) (free robot3 lgripper3)
   added: (carry robot3 ball12 lgripper3)
   goals met: 18 of 21
72. (drop robot1 ball3 room17 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room17) (free robot1 lgripper1)
   goals met: 19 of 21
73. (move robot3 room1 room22)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room22)
   goals met: 19 of 21
74. (move robot1 room17 room19)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room19)
   goals met: 19 of 21
75. (drop robot3 ball12 room22 lgripper3)
   deleted: (carry robot3 ball12 lgripper3)
   added: (at ball12 room22) (free robot3 lgripper3)
   goals met: 20 of 21
76. (drop robot1 ball2 room19 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room19) (free robot1 rgripper1)
   goals met: 21 of 21
